{
  "basics": {
    "name": "Jerry Hou",
    "email": "hhou39@gatch.edu",
    "phone": "954-296-2600",
    "website": "https://huidonghou.github.io",
    "summary": "Incoming first year graduate at Georgia Tech",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Earth",
      "countryCode": "US",
      "region": ""
    },
    "profiles": [
      {
        "network": "",
        "username": "",
        "url": ""
      },
      {
        "network": "",
        "username": "",
        "url": ""
      },
      {
        "network": "GitHub",
        "username": "huidonghou",
        "url": "https://github.com/huidonghou"
      }
    ]
  },
  "work": [],
  "education": [
    {
      "institution": "Boston College",
      "area": "B.S in Mathematics, Computer Sciences, Boston College, Chestnut Hill, MA",
      "studyType": "",
      "startDate": "",
      "endDate": "2023",
      "gpa": null,
      "courses": []
    },
    {
      "institution": "Georgia Tech",
      "area": "M.S. in Electrical and Computer Engineering",
      "studyType": "",
      "startDate": "",
      "endDate": "2027(expected)",
      "gpa": null,
      "courses": []
    }
  ],
  "skills": [],
  "languages": [],
  "interests": [],
  "references": [],
  "publications": [
    
  ],
  "presentations": [
  ],
  "teaching": [
    {
      "course": "CSCI 3381: Cryptography",
      "institution": "Department of Computer Science, Boston College",
      "date": "Spring 2023",
      "role": "Teaching Assistant",
      "description": "This undergradute course covers the fundamental concepts of cryptography, including symmetric and asymmetric encryption, hash functions, digital signatures, and public key infrastructure. It also explores the mathematical foundations of cryptographic protocols and their applications in securing communications."
    },
    {
      "course": "MATH4460: Complex Variables",
      "institution": "Department of Mathematics, Boston College",
      "date": "Spring 2023",
      "role": "TA",
      "description": "This course provides a foundational introduction to complex variables. We begin by exploring complex numbers, their geometric representations in the complex plane (Cartesian and polar coordinates), and the concept of the Riemann sphere.  The core of the course focuses on analytic (holomorphic) functions, covering complex limits, continuity, derivatives, and the essential Cauchy-Riemann equations. We will examine key examples, including the complex exponential, trigonometric, and logarithmic functions.  A significant portion of the course is dedicated to complex integration, introducing line integrals, Cauchy's Theorem, and Cauchy's Integral Formula. We will then delve into the local properties of holomorphic functions, such as zeros, poles, and the maximum principle, culminating in the powerful Residue Theorem and its diverse applications.  \n\nOptional advanced topics, if time permits and based on class interest, may include infinite series and product expansions, analytic continuation, an introduction to special functions (e.g., Gamma and Riemann zeta functions), and Möbius transformations."
    }
  ],
  "portfolio": [
  ]
}